<details>
<summary>Execution result of "run --all --non-interactive --summary-per-unit --log-level stderr --log-format bare -- plan" in "IaC/production/homelab"</summary>

```terraform

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
helm_release.nfs_media: Refreshing state... [id=nfs-subdir-external-provisioner-media]
helm_release.nfs_database: Refreshing state... [id=nfs-subdir-external-provisioner-database]
helm_release.nfs_subdir_external_provisioner: Refreshing state... [id=nfs-subdir-external-provisioner]
kubernetes_namespace_v1.metallb_system: Refreshing state... [id=metallb-system]
helm_release.metallb: Refreshing state... [id=metallb]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.external_secrets: Refreshing state... [id=external-secrets]
kubernetes_namespace_v1.metrics: Refreshing state... [id=metrics-server]
kubernetes_secret_v1.name: Refreshing state... [id=external-secrets/aws-ssm-secret]
helm_release.release: Refreshing state... [id=external-secrets]
helm_release.release: Refreshing state... [id=metrics-server]
kubernetes_namespace_v1.longhorn_system: Refreshing state... [id=longhorn-system]
helm_release.longhorn: Refreshing state... [id=longhorn]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_manifest.ip_address_pool: Refreshing state...
kubernetes_manifest.l2_advertisement: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.

Initializing the backend...

Initializing the backend...
kubernetes_manifest.external_secrets_secret_store: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/helm v3.1.1 to the shared cache directory...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.traefik: Refreshing state... [id=traefik]
helm_release.traefik: Refreshing state... [id=traefik]
kubernetes_manifest.traefik_certificate: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
aws_ssm_parameter.argocd["client_secret"]: Refreshing state... [id=/homelab/argocd/client_secret]
helm_release.argocd_image_updater: Refreshing state... [id=argocd-image-updater]
helm_release.release: Refreshing state... [id=argocd]
kubernetes_manifest.argocd_certificate: Refreshing state...
kubernetes_manifest.argocd_secret: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # helm_release.argocd_image_updater will be updated in-place
  ~ resource "helm_release" "argocd_image_updater" {
      ~ id                         = "argocd-image-updater" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.0.2" -> (known after apply)
          ~ chart          = "argocd-image-updater" -> (known after apply)
          ~ first_deployed = 1754265078 -> (known after apply)
          ~ last_deployed  = 1767398687 -> (known after apply)
          ~ name           = "argocd-image-updater" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 15 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - extraArgs = [
                      - "--interval",
                      - "2m",
                    ]
                }
            ) -> (known after apply)
          ~ version        = "1.0.4" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd-image-updater"
      ~ set_wo                     = (write-only attribute)
      - values                     = [
          - <<-EOT
                "extraArgs":
                - "--interval"
                - "2m"
            EOT,
        ] -> null
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of argoproj-labs/argocd from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Waiting for lock on cache directory /home/runner/.cache/terragrunt/providers
kubernetes_namespace_v1.minecraft: Refreshing state... [id=minecraft]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.minecraft: Refreshing state... [id=minecraft:]
kubernetes_namespace_v1.octobot: Refreshing state... [id=octobot]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # argocd_application.minecraft will be updated in-place
  ~ resource "argocd_application" "minecraft" {
        id       = "minecraft:"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "argocd-image-updater.argoproj.io/image-list"                = "minecraft=itzg/minecraft-server:latest" -> null
              - "argocd-image-updater.argoproj.io/minecraft.update-strategy" = "digest" -> null
            }
            name             = "minecraft"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.minecraft_image_updater will be created
  + resource "kubernetes_manifest" "minecraft_image_updater" {
      + manifest = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + name      = "minecraft-image-updater"
              + namespace = "minecraft"
            }
          + spec       = {
              + applicationRefs = [
                  + {
                      + images      = [
                          + {
                              + alias                = "minecraft"
                              + commonUpdateSettings = {
                                  + updateStrategy = "digest"
                                }
                              + imageName            = "itzg/minecraft-server:latest"
                            },
                        ]
                      + namePattern = "minecraft"
                    },
                ]
              + namespace       = "argocd"
            }
        }
      + object   = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "minecraft-image-updater"
              + namespace                  = "minecraft"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + applicationRefs      = [
                  + {
                      + commonUpdateSettings = {
                          + allowTags      = (known after apply)
                          + forceUpdate    = (known after apply)
                          + ignoreTags     = (known after apply)
                          + platforms      = (known after apply)
                          + pullSecret     = (known after apply)
                          + updateStrategy = (known after apply)
                        }
                      + images               = [
                          + {
                              + alias                = "minecraft"
                              + commonUpdateSettings = {
                                  + allowTags      = (known after apply)
                                  + forceUpdate    = (known after apply)
                                  + ignoreTags     = (known after apply)
                                  + platforms      = (known after apply)
                                  + pullSecret     = (known after apply)
                                  + updateStrategy = "digest"
                                }
                              + imageName            = "itzg/minecraft-server:latest"
                              + manifestTargets      = {
                                  + helm      = {
                                      + name = (known after apply)
                                      + spec = (known after apply)
                                      + tag  = (known after apply)
                                    }
                                  + kustomize = {
                                      + name = (known after apply)
                                    }
                                }
                            },
                        ]
                      + labelSelectors       = {
                          + matchExpressions = (known after apply)
                          + matchLabels      = (known after apply)
                        }
                      + namePattern          = "minecraft"
                      + writeBackConfig      = {
                          + gitConfig = {
                              + branch          = (known after apply)
                              + repository      = (known after apply)
                              + writeBackTarget = (known after apply)
                            }
                          + method    = (known after apply)
                        }
                    },
                ]
              + commonUpdateSettings = {
                  + allowTags      = (known after apply)
                  + forceUpdate    = (known after apply)
                  + ignoreTags     = (known after apply)
                  + platforms      = (known after apply)
                  + pullSecret     = (known after apply)
                  + updateStrategy = (known after apply)
                }
              + namespace            = "argocd"
              + writeBackConfig      = {
                  + gitConfig = {
                      + branch          = (known after apply)
                      + repository      = (known after apply)
                      + writeBackTarget = (known after apply)
                    }
                  + method    = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
kubernetes_manifest.octobot_tls: Refreshing state...
kubernetes_manifest.octobot_image_updater: Refreshing state...
argocd_application.octobot: Refreshing state... [id=octobot:]
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # argocd_application.octobot will be updated in-place
  ~ resource "argocd_application" "octobot" {
        id       = "octobot:"
        # (4 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (2 unchanged attributes hidden)

              ~ helm {
                    # (5 unchanged attributes hidden)

                  - parameter {
                      - force_string = true -> null
                      - name         = "image.name" -> null
                      - value        = "drakkarsoftware/octobot" -> null
                    }
                  - parameter {
                      - force_string = true -> null
                      - name         = "image.tag" -> null
                      - value        = "2.1.13" -> null
                    }
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.cert_manager: Refreshing state... [id=cert-manager]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.cloudflare_api_key_secret: Refreshing state... [id=/homelab/cert-manager/api_key]
data.aws_ssm_parameter.argocd_app_token: Read complete after 1s [id=/homelab/argocd/argocd_app_token]
argocd_application.cert_manager: Refreshing state... [id=cert-manager:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...
kubernetes_manifest.cloudflare_api_key_secret: Refreshing state...
kubernetes_manifest.cloudflare_clusterissuer: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.open_webui: Refreshing state... [id=open-webui]
kubernetes_ingress_v1.traefik: Refreshing state... [id=open-webui/open-webui-ingress]
kubernetes_ingress_v1.mcpo: Refreshing state... [id=open-webui/open-webui-mcpo-ingress]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.open_webui["openai_api_key"]: Refreshing state... [id=/homelab/open-webui/openai_api_key]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
kubernetes_manifest.open_webui_secret: Refreshing state...
argocd_application.open_webui: Refreshing state... [id=open-webui:]
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing argoproj-labs/argocd v7.12.4 to the shared cache directory...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # argocd_application.open_webui will be updated in-place
  ~ resource "argocd_application" "open_webui" {
        id       = "open-webui:"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "argocd-image-updater.argoproj.io/image-list"                 = "open-webui=ghcr.io/open-webui/open-webui:0.x" -> null
              - "argocd-image-updater.argoproj.io/open-webui.update-strategy" = "semver" -> null
            }
            name             = "open-webui"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.open_webui_image_updater will be created
  + resource "kubernetes_manifest" "open_webui_image_updater" {
      + manifest = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + name      = "open-webui-image-updater"
              + namespace = "open-webui"
            }
          + spec       = {
              + applicationRefs = [
                  + {
                      + images      = [
                          + {
                              + alias                = "open-webui"
                              + commonUpdateSettings = {
                                  + updateStrategy = "semver"
                                }
                              + imageName            = "ghcr.io/open-webui/open-webui:0.x"
                            },
                        ]
                      + namePattern = "open-webui"
                    },
                ]
              + namespace       = "argocd"
            }
        }
      + object   = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "open-webui-image-updater"
              + namespace                  = "open-webui"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + applicationRefs      = [
                  + {
                      + commonUpdateSettings = {
                          + allowTags      = (known after apply)
                          + forceUpdate    = (known after apply)
                          + ignoreTags     = (known after apply)
                          + platforms      = (known after apply)
                          + pullSecret     = (known after apply)
                          + updateStrategy = (known after apply)
                        }
                      + images               = [
                          + {
                              + alias                = "open-webui"
                              + commonUpdateSettings = {
                                  + allowTags      = (known after apply)
                                  + forceUpdate    = (known after apply)
                                  + ignoreTags     = (known after apply)
                                  + platforms      = (known after apply)
                                  + pullSecret     = (known after apply)
                                  + updateStrategy = "semver"
                                }
                              + imageName            = "ghcr.io/open-webui/open-webui:0.x"
                              + manifestTargets      = {
                                  + helm      = {
                                      + name = (known after apply)
                                      + spec = (known after apply)
                                      + tag  = (known after apply)
                                    }
                                  + kustomize = {
                                      + name = (known after apply)
                                    }
                                }
                            },
                        ]
                      + labelSelectors       = {
                          + matchExpressions = (known after apply)
                          + matchLabels      = (known after apply)
                        }
                      + namePattern          = "open-webui"
                      + writeBackConfig      = {
                          + gitConfig = {
                              + branch          = (known after apply)
                              + repository      = (known after apply)
                              + writeBackTarget = (known after apply)
                            }
                          + method    = (known after apply)
                        }
                    },
                ]
              + commonUpdateSettings = {
                  + allowTags      = (known after apply)
                  + forceUpdate    = (known after apply)
                  + ignoreTags     = (known after apply)
                  + platforms      = (known after apply)
                  + pullSecret     = (known after apply)
                  + updateStrategy = (known after apply)
                }
              + namespace            = "argocd"
              + writeBackConfig      = {
                  + gitConfig = {
                      + branch          = (known after apply)
                      + repository      = (known after apply)
                      + writeBackTarget = (known after apply)
                    }
                  + method    = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
- Installed argoproj-labs/argocd v7.12.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Using argoproj-labs/argocd v7.12.4 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.litellm: Refreshing state... [id=litellm]
aws_ssm_parameter.litellm_env["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=/homelab/litellm/env/AWS_ACCESS_KEY_ID]
aws_ssm_parameter.litellm_env["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=/homelab/litellm/env/AWS_SECRET_ACCESS_KEY]
aws_ssm_parameter.litellm["password"]: Refreshing state... [id=/homelab/litellm/database/password]
aws_ssm_parameter.litellm_env["OPENAI_API_KEY"]: Refreshing state... [id=/homelab/litellm/env/OPENAI_API_KEY]
aws_ssm_parameter.litellm_env["AWS_REGION_NAME"]: Refreshing state... [id=/homelab/litellm/env/AWS_REGION_NAME]
aws_ssm_parameter.litellm["username"]: Refreshing state... [id=/homelab/litellm/database/username]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.litellm: Refreshing state... [id=litellm:]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_manifest.litellm_image_updater: Refreshing state...
kubernetes_manifest.litellm_tls: Refreshing state...
kubernetes_manifest.litellm_secret: Refreshing state...
kubernetes_manifest.litellm_env_secret: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # argocd_application.litellm will be updated in-place
  ~ resource "argocd_application" "litellm" {
        id       = "litellm:"
        # (4 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                    # (5 unchanged attributes hidden)

                  - parameter {
                      - force_string = true -> null
                      - name         = "image.name" -> null
                      - value        = "ghcr.io/berriai/litellm-database" -> null
                    }
                  - parameter {
                      - force_string = true -> null
                      - name         = "image.tag" -> null
                      - value        = "main-stable@sha256:9479c030dfdc2728cb8e99fca5fea438015743ab30b50ec7df2af86f9c56cabd" -> null
                    }
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
kubernetes_namespace_v1.n8n: Refreshing state... [id=n8n]
kubernetes_ingress_v1.n8n_tailscale_funnel: Refreshing state... [id=n8n/n8n-tailscale-funnel]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.n8n_tls: Refreshing state...
argocd_application.n8n: Refreshing state... [id=n8n:]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # argocd_application.n8n will be updated in-place
  ~ resource "argocd_application" "n8n" {
        id       = "n8n:"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "argocd-image-updater.argoproj.io/image-list"          = "n8n=n8nio/n8n:1.122.x" -> null
              - "argocd-image-updater.argoproj.io/n8n.update-strategy" = "semver" -> null
            }
            name             = "n8n"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.n8n_image_updater will be created
  + resource "kubernetes_manifest" "n8n_image_updater" {
      + manifest = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + name      = "n8n-image-updater"
              + namespace = "n8n"
            }
          + spec       = {
              + applicationRefs = [
                  + {
                      + images      = [
                          + {
                              + alias                = "n8n"
                              + commonUpdateSettings = {
                                  + updateStrategy = "semver"
                                }
                              + imageName            = "n8nio/n8n:1.122.x"
                            },
                        ]
                      + namePattern = "n8n"
                    },
                ]
              + namespace       = "argocd"
            }
        }
      + object   = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "n8n-image-updater"
              + namespace                  = "n8n"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + applicationRefs      = [
                  + {
                      + commonUpdateSettings = {
                          + allowTags      = (known after apply)
                          + forceUpdate    = (known after apply)
                          + ignoreTags     = (known after apply)
                          + platforms      = (known after apply)
                          + pullSecret     = (known after apply)
                          + updateStrategy = (known after apply)
                        }
                      + images               = [
                          + {
                              + alias                = "n8n"
                              + commonUpdateSettings = {
                                  + allowTags      = (known after apply)
                                  + forceUpdate    = (known after apply)
                                  + ignoreTags     = (known after apply)
                                  + platforms      = (known after apply)
                                  + pullSecret     = (known after apply)
                                  + updateStrategy = "semver"
                                }
                              + imageName            = "n8nio/n8n:1.122.x"
                              + manifestTargets      = {
                                  + helm      = {
                                      + name = (known after apply)
                                      + spec = (known after apply)
                                      + tag  = (known after apply)
                                    }
                                  + kustomize = {
                                      + name = (known after apply)
                                    }
                                }
                            },
                        ]
                      + labelSelectors       = {
                          + matchExpressions = (known after apply)
                          + matchLabels      = (known after apply)
                        }
                      + namePattern          = "n8n"
                      + writeBackConfig      = {
                          + gitConfig = {
                              + branch          = (known after apply)
                              + repository      = (known after apply)
                              + writeBackTarget = (known after apply)
                            }
                          + method    = (known after apply)
                        }
                    },
                ]
              + commonUpdateSettings = {
                  + allowTags      = (known after apply)
                  + forceUpdate    = (known after apply)
                  + ignoreTags     = (known after apply)
                  + platforms      = (known after apply)
                  + pullSecret     = (known after apply)
                  + updateStrategy = (known after apply)
                }
              + namespace            = "argocd"
              + writeBackConfig      = {
                  + gitConfig = {
                      + branch          = (known after apply)
                      + repository      = (known after apply)
                      + writeBackTarget = (known after apply)
                    }
                  + method    = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.technitium: Refreshing state... [id=technitium]
kubernetes_persistent_volume_claim.technitium_config: Refreshing state... [id=technitium/technitium-config-pvc]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.technitium: Refreshing state... [id=technitium:]
kubernetes_manifest.technitium_certificate: Refreshing state...
kubernetes_ingress_v1.traefik: Refreshing state... [id=technitium/technitium]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # argocd_application.technitium will be updated in-place
  ~ resource "argocd_application" "technitium" {
        id       = "technitium:"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "argocd-image-updater.argoproj.io/image-list"                = "technitium=technitium/dns-server:13.x" -> null
              - "argocd-image-updater.argoproj.io/tailscale.update-strategy" = "semver" -> null
            }
            name             = "technitium"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.technitium_image_updater will be created
  + resource "kubernetes_manifest" "technitium_image_updater" {
      + manifest = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + name      = "technitium-image-updater"
              + namespace = "technitium"
            }
          + spec       = {
              + applicationRefs = [
                  + {
                      + images      = [
                          + {
                              + alias                = "technitium"
                              + commonUpdateSettings = {
                                  + updateStrategy = "semver"
                                }
                              + imageName            = "technitium/dns-server:13.x"
                            },
                        ]
                      + namePattern = "technitium"
                    },
                ]
              + namespace       = "argocd"
            }
        }
      + object   = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "technitium-image-updater"
              + namespace                  = "technitium"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + applicationRefs      = [
                  + {
                      + commonUpdateSettings = {
                          + allowTags      = (known after apply)
                          + forceUpdate    = (known after apply)
                          + ignoreTags     = (known after apply)
                          + platforms      = (known after apply)
                          + pullSecret     = (known after apply)
                          + updateStrategy = (known after apply)
                        }
                      + images               = [
                          + {
                              + alias                = "technitium"
                              + commonUpdateSettings = {
                                  + allowTags      = (known after apply)
                                  + forceUpdate    = (known after apply)
                                  + ignoreTags     = (known after apply)
                                  + platforms      = (known after apply)
                                  + pullSecret     = (known after apply)
                                  + updateStrategy = "semver"
                                }
                              + imageName            = "technitium/dns-server:13.x"
                              + manifestTargets      = {
                                  + helm      = {
                                      + name = (known after apply)
                                      + spec = (known after apply)
                                      + tag  = (known after apply)
                                    }
                                  + kustomize = {
                                      + name = (known after apply)
                                    }
                                }
                            },
                        ]
                      + labelSelectors       = {
                          + matchExpressions = (known after apply)
                          + matchLabels      = (known after apply)
                        }
                      + namePattern          = "technitium"
                      + writeBackConfig      = {
                          + gitConfig = {
                              + branch          = (known after apply)
                              + repository      = (known after apply)
                              + writeBackTarget = (known after apply)
                            }
                          + method    = (known after apply)
                        }
                    },
                ]
              + commonUpdateSettings = {
                  + allowTags      = (known after apply)
                  + forceUpdate    = (known after apply)
                  + ignoreTags     = (known after apply)
                  + platforms      = (known after apply)
                  + pullSecret     = (known after apply)
                  + updateStrategy = (known after apply)
                }
              + namespace            = "argocd"
              + writeBackConfig      = {
                  + gitConfig = {
                      + branch          = (known after apply)
                      + repository      = (known after apply)
                      + writeBackTarget = (known after apply)
                    }
                  + method    = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with kubernetes_persistent_volume_claim.technitium_config,
│   on main.tf line 10, in resource "kubernetes_persistent_volume_claim" "technitium_config":
│   10: resource "kubernetes_persistent_volume_claim" "technitium_config" {
│ 
│ Deprecated; use kubernetes_persistent_volume_claim_v1.
│ 
│ (and one more similar warning elsewhere)
╵
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.homeassistant: Refreshing state... [id=homeassistant]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.certificate: Refreshing state...
kubernetes_manifest.homeassistant_image_updater: Refreshing state...
argocd_application.homeassistant: Refreshing state... [id=homeassistant:]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.homarr: Refreshing state... [id=homarr]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.db_secret["db-encryption-key"]: Refreshing state... [id=/homelab/homarr/db-encryption-key]
aws_ssm_parameter.db_secret["mysql-root-password"]: Refreshing state... [id=/homelab/homarr/mysql-root-password]
aws_ssm_parameter.db_secret["mysql-password"]: Refreshing state... [id=/homelab/homarr/mysql-password]
aws_ssm_parameter.db_secret["db-url"]: Refreshing state... [id=/homelab/homarr/db-url]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.homarr_image_updater: Refreshing state...
kubernetes_manifest.homarr_certificate: Refreshing state...
kubernetes_manifest.db_secret: Refreshing state...
argocd_application.homarr: Refreshing state... [id=homarr:]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # argocd_application.homarr will be updated in-place
  ~ resource "argocd_application" "homarr" {
        id       = "homarr:"
        # (4 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (4 unchanged attributes hidden)

              ~ helm {
                    # (5 unchanged attributes hidden)

                  - parameter {
                      - force_string = false -> null
                      - name         = "database.migrationEnabled" -> null
                      - value        = "false" -> null
                    }
                  - parameter {
                      - force_string = false -> null
                      - name         = "image.pullPolicy" -> null
                      - value        = "Always" -> null
                    }
                  - parameter {
                      - force_string = false -> null
                      - name         = "mysql.internal" -> null
                      - value        = "true" -> null
                    }
                  - parameter {
                      - force_string = false -> null
                      - name         = "rbac.enabled" -> null
                      - value        = "true" -> null
                    }
                  - parameter {
                      - force_string = true -> null
                      - name         = "image.name" -> null
                      - value        = "ghcr.io/homarr-labs/homarr" -> null
                    }
                  - parameter {
                      - force_string = true -> null
                      - name         = "image.tag" -> null
                      - value        = "latest@sha256:369542253675b83b89babdf030c4d3c6975e169d1d9e38e7be175b5704fccf15" -> null
                    }
                  + parameter {
                      + name  = "database.migrationEnabled"
                      + value = "false"
                    }
                  + parameter {
                      + name  = "image.pullPolicy"
                      + value = "Always"
                    }
                  + parameter {
                      + name  = "mysql.internal"
                      + value = "true"
                    }
                  + parameter {
                      + name  = "rbac.enabled"
                      + value = "true"
                    }
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.descheduler: Refreshing state... [id=descheduler]
data.aws_ssm_parameter.argocd_app_token: Reading...
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.descheduler: Refreshing state... [id=descheduler:]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.tailscale: Refreshing state... [id=tailscale]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.oauth_secret["client_secret"]: Refreshing state... [id=/homelab/tailscale/client_secret]
aws_ssm_parameter.oauth_secret["client_id"]: Refreshing state... [id=/homelab/tailscale/client_id]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.tailscale: Refreshing state... [id=tailscale:]
kubernetes_manifest.tailscale_connector: Refreshing state...
kubernetes_manifest.oauth_secret: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.cloudflare-tunnel: Refreshing state... [id=cloudflare-tunnel]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.secret["account_id"]: Refreshing state... [id=/homelab/cloudflare-tunnel/account_id]
aws_ssm_parameter.secret["tunnel_name"]: Refreshing state... [id=/homelab/cloudflare-tunnel/tunnel_name]
aws_ssm_parameter.secret["api_token"]: Refreshing state... [id=/homelab/cloudflare-tunnel/api_token]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.secret: Refreshing state...
argocd_application.cloudflare-tunnel: Refreshing state... [id=cloudflare-tunnel-ingress-controller:]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.postgresql: Refreshing state... [id=database]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.postgresql_secret["replication-password"]: Refreshing state... [id=/homelab/database/replication-password]
aws_ssm_parameter.postgresql_secret["password"]: Refreshing state... [id=/homelab/database/password]
aws_ssm_parameter.postgresql_secret["postgres-password"]: Refreshing state... [id=/homelab/database/postgres-password]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
kubernetes_manifest.postgresql_secret: Refreshing state...
argocd_application.postgresql: Refreshing state... [id=postgresql:]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.monitoring: Refreshing state... [id=monitoring]
data.aws_ssm_parameter.argocd_app_token: Reading...
aws_ssm_parameter.umami["umami_database_url"]: Refreshing state... [id=/homelab/monitoring/umami_database_url]
kubernetes_ingress_v1.umami_tailscale_funnel: Refreshing state... [id=monitoring/umami-tailscale-funnel]
data.aws_ssm_parameter.argocd_app_token: Read complete after 0s [id=/homelab/argocd/argocd_app_token]
argocd_application.prometheus: Refreshing state... [id=prometheus:]
kubernetes_manifest.umami_secret: Refreshing state...
kubernetes_manifest.monitoring_certificate: Refreshing state...
argocd_application.umami: Refreshing state... [id=umami:]
argocd_application.grafana: Refreshing state... [id=grafana:]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # argocd_application.prometheus will be updated in-place
  ~ resource "argocd_application" "prometheus" {
        id       = "prometheus:"
        # (4 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
              ~ chart           = "prometheus" -> "kube-prometheus-stack"
                # (3 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

          ~ sync_policy {
              ~ sync_options = [
                  + "ServerSideApply=true",
                ]

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # argocd_application.umami will be updated in-place
  ~ resource "argocd_application" "umami" {
        id       = "umami:"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "argocd-image-updater.argoproj.io/image-list"            = "umami=ghcr.io/umami-software/umami:postgresql-v2" -> null
              - "argocd-image-updater.argoproj.io/umami.update-strategy" = "digest" -> null
            }
            name             = "umami"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.umami_image_updater will be created
  + resource "kubernetes_manifest" "umami_image_updater" {
      + manifest = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + name      = "umami-image-updater"
              + namespace = "monitoring"
            }
          + spec       = {
              + applicationRefs = [
                  + {
                      + images      = [
                          + {
                              + alias                = "umami"
                              + commonUpdateSettings = {
                                  + updateStrategy = "digest"
                                }
                              + imageName            = "ghcr.io/umami-software/umami:postgresql-v2"
                            },
                        ]
                      + namePattern = "umami"
                    },
                ]
              + namespace       = "argocd"
            }
        }
      + object   = {
          + apiVersion = "argocd-image-updater.argoproj.io/v1alpha1"
          + kind       = "ImageUpdater"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "umami-image-updater"
              + namespace                  = "monitoring"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + applicationRefs      = [
                  + {
                      + commonUpdateSettings = {
                          + allowTags      = (known after apply)
                          + forceUpdate    = (known after apply)
                          + ignoreTags     = (known after apply)
                          + platforms      = (known after apply)
                          + pullSecret     = (known after apply)
                          + updateStrategy = (known after apply)
                        }
                      + images               = [
                          + {
                              + alias                = "umami"
                              + commonUpdateSettings = {
                                  + allowTags      = (known after apply)
                                  + forceUpdate    = (known after apply)
                                  + ignoreTags     = (known after apply)
                                  + platforms      = (known after apply)
                                  + pullSecret     = (known after apply)
                                  + updateStrategy = "digest"
                                }
                              + imageName            = "ghcr.io/umami-software/umami:postgresql-v2"
                              + manifestTargets      = {
                                  + helm      = {
                                      + name = (known after apply)
                                      + spec = (known after apply)
                                      + tag  = (known after apply)
                                    }
                                  + kustomize = {
                                      + name = (known after apply)
                                    }
                                }
                            },
                        ]
                      + labelSelectors       = {
                          + matchExpressions = (known after apply)
                          + matchLabels      = (known after apply)
                        }
                      + namePattern          = "umami"
                      + writeBackConfig      = {
                          + gitConfig = {
                              + branch          = (known after apply)
                              + repository      = (known after apply)
                              + writeBackTarget = (known after apply)
                            }
                          + method    = (known after apply)
                        }
                    },
                ]
              + commonUpdateSettings = {
                  + allowTags      = (known after apply)
                  + forceUpdate    = (known after apply)
                  + ignoreTags     = (known after apply)
                  + platforms      = (known after apply)
                  + pullSecret     = (known after apply)
                  + updateStrategy = (known after apply)
                }
              + namespace            = "argocd"
              + writeBackConfig      = {
                  + gitConfig = {
                      + branch          = (known after apply)
                      + repository      = (known after apply)
                      + writeBackTarget = (known after apply)
                    }
                  + method    = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

❯❯ Run Summary  21 units  3m
   ────────────────────────────
   Succeeded (21)
      monitoring ........ 2m
      database .......... 2m
      cloudflare-tunnel . 2m
      tailscale ......... 1m
      descheduler ....... 1m
      homarr ............ 1m
      homeassistant ..... 1m
      technitium ........ 1m
      n8n ............... 1m
      litellm ........... 1m
      open-webui ........ 53s
      cert-manager ...... 45s
      octobot ........... 35s
      minecraft ......... 33s
      argocd ............ 29s
      external-secrets .. 13s
      longhorn .......... 12s
      metallb ........... 11s
      metrics ........... 10s
      traefik ........... 8s
      storage ........... 6s
```

</details>
    
